Revit 2027 API
RebarConstraint.IsValid Method
 Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace